Revit 2024 API
FilteredWorksetCollector.FirstWorkset Method
 Returns the first workset to pass the filter(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Workset FirstWorkset()
Visual Basic
Public Function FirstWorkset As Workset
Visual C++
public:
Workset^ FirstWorkset()
Return Value
 The first workset.
Remarks
 This will reset the collector to the beginning and find the first workset that passes the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter.
See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace